cmsis-svd/cmsis-svd/data/Spansion/MB9BF61xS_svd.xml
        <!-- REGISTER "rxlengtherror" -->
        <register>
          <name>rxlengtherror</name>
          <description>"Number of frames received with length error (Length type field is not the frame size), for all frames with valid length field. "</description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxoutofrangetype" -->
        <register>
          <name>rxoutofrangetype</name>
          <description>Number of frames received with length/type field not equal to the valid frame size (>1500) </description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxpauseframes" -->
        <register>
          <name>rxpauseframes</name>
          <description>Number of good and valid PAUSE frames received. </description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxfifooverflow" -->
        <register>
          <name>rxfifooverflow</name>
          <description>Number of missed received frames due to FIFO overflow. </description>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxvlanframes_gb" -->
        <register>
          <name>rxvlanframes_gb</name>
          <description>Number of good and bad VLAN frames received. </description>
          <addressOffset>0x1D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxwatchdogerror" -->
        <register>
          <name>rxwatchdogerror</name>
          <description>Number of frames received with error due to watchdog timeout error (frames with a data load larger than 2048 bytes). </description>
          <addressOffset>0x1DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "mmc_ipc_intr_mask_rx" -->
        <register>
          <name>mmc_ipc_intr_mask_rx</name>
          <description>MMC Receive Checksum Offload Interrupt Mask Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
        </register>
        <!-- REGISTER "mmc_ipc_intr_rx" -->
        <register>
          <name>mmc_ipc_intr_rx</name>
          <description>MMC Receive Checksum Offload Interrupt Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_gd_frms" -->
        <register>
          <name>rxipv4_gd_frms</name>
          <description>"Number of good IPv4 datagrams received with the TCP, UDP, or ICMP payload  "</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_hdrerr_frms" -->
        <register>
          <name>rxipv4_hdrerr_frms</name>
          <description>"Number of IPv4 datagrams received with header errors (checksum, length, or version mismatch) "</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_nopay_frms" -->
        <register>
          <name>rxipv4_nopay_frms</name>
          <description>"Number of IPv4 datagram frames received that did not have a TCP, UDP, or ICMP payload processed by the Checksum engine "</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_frag_frms" -->
        <register>
          <name>rxipv4_frag_frms</name>
          <description>Number of good IPv4 datagrams with fragmentation </description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_udsbl_frms" -->
        <register>
          <name>rxipv4_udsbl_frms</name>
          <description>Number of good IPv4 datagrams received that had a UDP payload with checksum disabled </description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_gd_frms" -->
        <register>
          <name>rxipv6_gd_frms</name>
          <description>"Number of good IPv6 datagrams received with TCP, UDP, or ICMP payloads "</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_hdrerr_frms" -->
        <register>
          <name>rxipv6_hdrerr_frms</name>
          <description>Number of IPv6 datagrams received with header errors (length or version mismatch) </description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_nopay_frms" -->
        <register>
          <name>rxipv6_nopay_frms</name>
          <description>"Number of IPv6 datagram frames received that did not have a TCP, UDP, or ICMP payload. This includes all IPv6 datagrams with fragmentation or security extension headers  "</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxudp_gd_frms" -->
        <register>
          <name>rxudp_gd_frms</name>
          <description>Number of good IP datagrams with a good UDP payload. This counter is not updated when the rxipv4_udsbl_frms counter is incremented. </description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxudp_err_frms" -->
        <register>
          <name>rxudp_err_frms</name>
          <description>Number of good IP datagrams whose UDP payload has a checksum error</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxtcp_gd_frms" -->
        <register>
          <name>rxtcp_gd_frms</name>
          <description>Number of good IP datagrams with a good TCP payload </description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxtcp_err_frms" -->
        <register>
          <name>rxtcp_err_frms</name>
          <description>Number of good IP datagrams whose TCP payload has a checksum error</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
