cmsis-svd/cmsis-svd/data/Spansion/MB9BF61xS_svd.xml
        <!-- REGISTER "rxtcp_gd_octets" -->
        <register>
          <name>rxtcp_gd_octets</name>
          <description>Number of bytes received in a good TCP segment </description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxtcp_err_octets" -->
        <register>
          <name>rxtcp_err_octets</name>
          <description>Number of bytes received in a TCP segment with checksum errors </description>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxicmp_gd_octets" -->
        <register>
          <name>rxicmp_gd_octets</name>
          <description>Number of bytes received in a good ICMP segment </description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxicmp_err_octets" -->
        <register>
          <name>rxicmp_err_octets</name>
          <description>Number of bytes received in an ICMP segment with checksum errors</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RGSR" -->
        <register>
          <name>RGSR</name>
          <description>RGMII Status Register)</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LS" -->
            <field>
              <name>LS</name>
              <description>Link Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LSP" -->
            <field>
              <name>LSP</name>
              <description>Link Speed</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LM" -->
            <field>
              <name>LM</name>
              <description>Link Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCR" -->
        <register>
          <name>TSCR</name>
          <description>Time Stamp Control Register</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <resetMask>0x0107FF3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ATSFC" -->
            <field>
              <name>ATSFC</name>
              <description>Auxiliary Snapshot FIFO Clear</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSENMF" -->
            <field>
              <name>TSENMF</name>
              <description>Enable MAC address for PTP frame filtering</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSPS" -->
            <field>
              <name>TSPS</name>
              <description>SelectPTP packets for taking snapshots</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSMRM" -->
            <field>
              <name>TSMRM</name>
              <description>Enable Snapshot for Messages Relevant to Master</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TETSEM" -->
            <field>
              <name>TETSEM</name>
              <description>Enable Time Stamp Snapshot for Event Messages</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSIP4E" -->
            <field>
              <name>TSIP4E</name>
              <description>Enable Time Stamp Snapshot for IPv4 frames</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSIP6E" -->
            <field>
              <name>TSIP6E</name>
              <description>Enable Time Stamp Snapshot for IPv6 frames</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TETSP" -->
            <field>
              <name>TETSP</name>
              <description>Enable Time Stamp Snapshot for PTP over Ethernet frames</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSV2E" -->
            <field>
              <name>TSV2E</name>
              <description>Enable PTP packet snooping for version 2 format</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSDB" -->
            <field>
              <name>TSDB</name>
              <description>Time Stamp Digital or Binary rollover control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSEA" -->
            <field>
              <name>TSEA</name>
              <description>Enable Time Stamp for All Frames</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TARU" -->
            <field>
              <name>TARU</name>
              <description>Addend Register Update</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TITE" -->
            <field>
              <name>TITE</name>
              <description>Time Stamp Interrupt Trigger Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSU" -->
            <field>
              <name>TSU</name>
              <description>Time Stamp Update</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSI" -->
            <field>
              <name>TSI</name>
              <description>Time Stamp Initialize</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFCU" -->
            <field>
              <name>TFCU</name>
              <description>Time Stamp Fine or Coarse Update</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSE" -->
            <field>
              <name>TSE</name>
              <description>Time Stamp Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SSIR" -->
        <register>
          <name>SSIR</name>
          <description>Sub-Second Increment Register</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSINC" -->
            <field>
              <name>SSINC</name>
              <description>Sub-Second Increment Value</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STSR" -->
        <register>
          <name>STSR</name>
          <description>System Time - Seconds Register</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSS" -->
            <field>
              <name>TSS</name>
              <description>Time Stamp Second</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
